app/controllers/countries_controller.rb

  def index

    @country = Country.all
---
SELECT "countries".* FROM "countries"