app/controllers/teas_controller.rb

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "teas".* FROM "teas" WHERE "teas"."country_id" = ?  [["country_id", 2]]
---
def index
@country = Country.find(params[:country_id])
@tea = @country.teas.all